app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 14]]
INSERT INTO "comments" ("author", "content") VALUES ($1, $2) RETURNING "id"  [["author", "Sue"], ["content", "this is my comment"]]
---
    def create
      @post = Post.find(params[:post_id])
      @comment = Comment.create!(whitelisted_comment_params)