app/controllers/posts_controller.rb

  def index
      @posts = Post.all
      @posts = User.find(session[:user]["id"]).posts
---
SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

    def create
      @post = Post.create!(whitelisted_post_params)
      @user = User.find(session[:user]["id"])
---
INSERT INTO "posts" ("author", "title", "content", "user_id", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "ss"], ["title", "ss"], ["content", "ss"], ["user_id", 1], ["created_at", "2015-07-31 18:30:53.491294"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

    def show
      # binding.pry
      @post = Post.find(params[:id])
      # @comment = Comment.new
      # @comments = Comment.find(params[:id])
      # @comments = Comment.all
      @comments = @post.comments.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]

    def update
      @post = Post.find(params[:id])
      @post.update(whitelisted_post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "posts" SET "author" = $1, "title" = $2, "content" = $3 WHERE "posts"."id" = $4  [["author", "Tony"], ["title", "Posty Post"], ["content", "This is my post.\r\n\r\nThis is my post.\r\n\r\nThis is my post.\r\n\r\nThis is my post.\r\n\r\nThis is my post."], ["id", 8]]