app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest") VALUES ($1, $2) RETURNING "id"  [["username", "kg"], ["password_digest", "kg"]]
---
  def sign_up!
    user = User.new(
      username: params[:username],
      password_digest: BCrypt::Password.create(params[:password])
    )

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "kg"]]
---
  def sign_in!
    @user = User.find_by(username: params[:username])